//确认密码
#include <stdio.h>

int main()
{
	int ret = 0, ch = 0;
	char password[20] = { 0 };
	printf("请输入密码：>");
	scanf("%s", password);//输入密码,并存放在passsword数组中

	printf("请确认(Y/N):>");
	ret = getchar();//输入一个Y/N字符
	if (ret == 'Y')//判断是否输入的事“Y”
	{
		printf("确认成功\n");//如果输入“Y”字符则输出确认成功
	}
	else
	{
		printf("放弃确认\n");//否则输出确认成功
	}

	return 0;
}

//-----------------------出现问题-----------------------------------

//出现错误：运行程序，输入密码，确定后，没有下一步操作就直接放弃确认

/* - 分析步骤
	步骤1：经过输入函数，输入密码：1234
	步骤2：输入的密码放入缓冲区
	步骤3：因为输入1234的时候还有一个“\n”结束符,1234放入数组,但是“\n”还放在输入缓冲区,所以getchar()接受的是“\n”
	步骤4：getchar接收的“\n”赋值给ret
	步骤5：if语句判断ret的内容不为“Y"，所以执行elsei语句操作

*/

//程序没有下一步操作就直接放弃确认

//-----------------------出现问题-----------------------------------