//联合体

//面试题 - 大小端问题

//#include <stdio.h>
//
//int main()
//{
//	int a = 1;
//	if (1 == *(char*)&a)
//	{
//		printf("小端\n");
//	}
//	else
//	{
//		printf("大端\n");
//	}
//	// int a = 0x11223344; 
//	// 
//	//	低地址---------------->高地址
//	//	....[][][][][11][22][33][44][][][][][][][]...	大端字节序存储模式
//	//  ....[][][][][44][33][22][11][][][][][][][]...	小端字节序存储模式
//	//	讨论一个数据，放在内存中的存放的字节顺序
//	//	大小端字节序问题
//	//
//
//	return 0;
//}

//封装成函数
#include <stdio.h>

int check_sys()
{
	int a = 1;
	return *(char*)&a;
}

int main()
{
	int ret = check_sys();

	if (1 == ret)
	{
		printf("小端\n");
	}
	else
	{
		printf("大端\n");
	}

	return 0;
}