#include <stdio.h> 

int i;  /*全局变量-不初始化-默认是0*/

int main()
{
	i--;
	//-1
	//10000000000000000000000000000001
	//11111111111111111111111111111110
	//11111111111111111111111111111111
	//
	if (i > sizeof(i))  //sizeof() - 计算变量 / 类型所占内存的大小 >= 无符号数
                        //sizeof求得大小大于或等于0，所哟一sizeof不可能是负数
	{
		printf(">\n");
	}
	else
	{
		printf("<\n");
	}

	return 0;
}

/*
	当sizeof (i)的数转成无符号数
	i和sizeof (i)比较的话
	i会被转换成无符号的整数，
	-1被转换成无符号的整数会变成很大的数
	所以i>sizeof(i)
	所以为真，输出 >

*/